; domain
(define (domain shakey)
  ; The domain is a representation of Shakey
  ; and how he can interact with the surrounding world.
   (:requirements
       :strips
    )
   (:predicates (room ?r) ; r: room
		(gripper ?g) ; g: gripper
		(at-shakey ?r) ; r: room - Is Shakey in the room r?
		(at ?o ?r) ; o: object, r: room - Is the object o in room r?
		(free ?g) ; g: gripper - Is the gripper g free?
		(door ?d) ; d: door
		(wide ?d) ; d: door - Is the door d wide?
		(small-object ?o) ; o: object - Is the object o small?
		(carry ?o ?g) ; o:object, g: gripper  - Is shakey carrying object o with the gripper g?
		(box ?b) ; b: box
		(lightswitch ?l) ; l: lightswitch
		(door-between ?d ?ra ?rb) ; d: door, ra: room-a, rb: room-b
		                          ; - Is there a door d between room ra and room rb?
		(lightswitch-on ?s) ; s: switch - Is lightswitch s turned on?
		
   )
   
   (:action move
       ; This is used to move Shakey between rooms (provided that there is a door).
       :parameters  (?from ?to ?door)
       :precondition (and  (room ?from) (room ?to) (door ?door) (door-between ?door ?from ?to) (at-shakey ?from))
       :effect (and  (at-shakey ?to)
		     (not (at-shakey ?from))))

   (:action pick
       ; Shakey can pick up small objects with a free gripper.
       :parameters (?obj ?room ?gripper ?switch)
       :precondition  (and  (small-object ?obj) (room ?room) (gripper ?gripper) (lightswitch ?switch) 
       		      (lightswitch-on ?switch) (at ?switch ?room)
			    (at ?obj ?room) (at-shakey ?room) (free ?gripper))
       :effect (and (carry ?obj ?gripper)
		    (not (at ?obj ?room)) 
		    (not (free ?gripper))))

   (:action drop
       ; Shakey can drop objects he is holding with a gripper.
       :parameters  (?obj ?room ?gripper)
       :precondition  (and  (small-object ?obj) (room ?room) (gripper ?gripper)
			    (carry ?obj ?gripper) (at-shakey ?room))
       :effect (and (at ?obj ?room)
		    (free ?gripper)
		    (not (carry ?obj ?gripper))))

   (:action push
       ; Shakey can push a large box between rooms provided there is a wide door.
       :parameters (?from ?to ?box ?door)
       :precondition (and (box ?box) (at ?box ?from) (room ?from) (room ?to)
			  (at-shakey ?from) (door ?door) (wide ?door) (door-between ?door ?from ?to)
		     )
       :effect(and (at-shakey ?to) (at ?box ?to) (not(at-shakey ?from)) (not(at ?box ?from)))
   )
		      
   (:action turn_light_on
       ; Shakey can turn on a light with a free gripper.
       :parameters (?room ?box ?switch ?gripper)
       :precondition (and (box ?box) (at ?box ?room) (room ?room) (at-shakey ?room)
			  (gripper ?gripper) (free ?gripper)
			  (lightswitch ?switch) (at ?switch ?room)
			  (not (lightswitch-on ?switch))
		     )
       :effect(lightswitch-on ?switch)
   )

   (:action turn_light_off
       ; Shakey can turn off a light with a free gripper.
       :parameters (?room ?box ?switch ?gripper)
       :precondition (and (box ?box) (at ?box ?room) (room ?room) (at-shakey ?room)
			  (gripper ?gripper) (free ?gripper)
			  (lightswitch ?switch) (at ?switch ?room)
			  (lightswitch-on ?switch)
		     )
       :effect(not (lightswitch-on ?switch))
   )
)

; problem
(define (problem move_small_objects_to_a)
  (:domain shakey)
  (:objects rooma roomb roomc switcha switchb switchc boxa wideab widebc narrowbc left right blockx blocky blockz)
  (:init (room rooma)
          (room roomb)
	  (room roomc)
	  (door wideab)
	  (door widebc)
	  (door narrowbc)
	  (small-object blockx)
	  (small-object blocky)
	  (small-object blockz)
	  (lightswitch switcha)
	  (lightswitch switchb)
	  (lightswitch switchc)
	  (box boxa)
          (gripper left)
          (gripper right)
          (at-shakey rooma)
          (free left)
          (free right)
	  (wide wideab)
	  (wide widebc)
	  (door-between wideab rooma roomb)
	  (door-between wideab roomb rooma)
	  (door-between widebc roomb roomc)
	  (door-between widebc roomc roomb)
	  (door-between narrowbc roomb roomc)
	  (door-between narrowbc roomc roomb)
	  (at boxa roomc)
	  (at switcha rooma)
          (at switchb roomb)
	  (at switchc roomc)
	  (at blockx roomb)
	  (at blocky roomc)
	  (at blockz roomc)
	  )
   (:goal (and (lightswitch-on switcha) (not (lightswitch-on switchb)) (not (lightswitch-on switchc))
	       (at blockx rooma) (at blocky rooma) (at blockz rooma) (at-shakey rooma)
          )
   )
)

; plan
1. (move rooma roomb wideab)
   deleted: (at-shakey rooma)
   added: (at-shakey roomb)
   goals met: 2 of 7
2. (move roomb roomc narrowbc)
   deleted: (at-shakey roomb)
   added: (at-shakey roomc)
   goals met: 2 of 7
3. (turn_light_on roomc boxa switchc left)
   added: (lightswitch-on switchc)
   goals met: 1 of 7
4. (pick blocky roomc left switchc)
   deleted: (at blocky roomc) (free left)
   added: (carry blocky left)
   goals met: 1 of 7
5. (pick blockz roomc right switchc)
   deleted: (at blockz roomc) (free right)
   added: (carry blockz right)
   goals met: 1 of 7
6. (push roomc roomb boxa widebc)
   deleted: (at-shakey roomc) (at boxa roomc)
   added: (at-shakey roomb) (at boxa roomb)
   goals met: 1 of 7
7. (push roomb rooma boxa wideab)
   deleted: (at-shakey roomb) (at boxa roomb)
   added: (at-shakey rooma) (at boxa rooma)
   goals met: 2 of 7
8. (drop blocky rooma left)
   deleted: (carry blocky left)
   added: (at blocky rooma) (free left)
   goals met: 3 of 7
9. (drop blockz rooma right)
   deleted: (carry blockz right)
   added: (at blockz rooma) (free right)
   goals met: 4 of 7
10. (turn_light_on rooma boxa switcha left)
   added: (lightswitch-on switcha)
   goals met: 5 of 7
11. (push rooma roomb boxa wideab)
   deleted: (at-shakey rooma) (at boxa rooma)
   added: (at-shakey roomb) (at boxa roomb)
   goals met: 4 of 7
12. (turn_light_on roomb boxa switchb left)
   added: (lightswitch-on switchb)
   goals met: 3 of 7
13. (pick blockx roomb left switchb)
   deleted: (at blockx roomb) (free left)
   added: (carry blockx left)
   goals met: 3 of 7
14. (turn_light_off roomb boxa switchb right)
   deleted: (lightswitch-on switchb)
   goals met: 4 of 7
15. (push roomb roomc boxa widebc)
   deleted: (at-shakey roomb) (at boxa roomb)
   added: (at-shakey roomc) (at boxa roomc)
   goals met: 4 of 7
16. (turn_light_off roomc boxa switchc right)
   deleted: (lightswitch-on switchc)
   goals met: 5 of 7
17. (move roomc roomb narrowbc)
   deleted: (at-shakey roomc)
   added: (at-shakey roomb)
   goals met: 5 of 7
18. (move roomb rooma wideab)
   deleted: (at-shakey roomb)
   added: (at-shakey rooma)
   goals met: 6 of 7
19. (drop blockx rooma left)
   deleted: (carry blockx left)
   added: (at blockx rooma) (free left)
   goals met: 7 of 7
